Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS.#ctor(System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
Creates a new instance of Round Bar shape.
diameter:
Pipe Diameter.
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
analysisParams:
Common set of parameters for structural analysis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS
Defines parameters for Round Bar structural section.
Since:
2018